In [1]:
print(2+3)

5

In [59]:
# Sample dataframe to be used in most of the functions below.
import pandas as pd
# assign data of lists.
data =  {'Name': ['Tom', 'Joseph', 'Krish', 'John','Linn'], 'Age': [20, 21, 19, 18,20],'StudentID':[1,2,3,4,5],'Topic_1_E1_C1':['DigestiveSystem','Botany','Cell Bilology','Cell-Physiology','Nervous-System'],'Topic_E1_C1':['Italy','Germany','France','Sweden','Poland']}
# Create DataFrame.
testdf = pd.DataFrame(data)
# Print the output.
print(testdf)

     Name  Age  StudentID    Topic_1_E1_C1 Topic_E1_C1
0     Tom   20          1  DigestiveSystem       Italy
1  Joseph   21          2           Botany     Germany
2   Krish   19          3    Cell Bilology      France
3    John   18          4  Cell-Physiology      Sweden
4    Linn   20          5   Nervous-System      Poland

Function or order(arrange columns) in a particular Order from Left.

In [60]:
# Function to order column in a particular order
#Very Handy to get unique columns in the begining, esp in case of Wide Dataset.
# REF : https://stackoverflow.com/questions/13148429/how-to-change-the-order-of-dataframe-columns
def order(frame,var):
    if type(var) is str:
        var = [var] #let the command take a string or list
    varlist =[w for w in frame.columns if w not in var]
    frame = frame[var+varlist]
    return frame

In [61]:
testdf = order(testdf,['StudentID','Name'])
print(testdf)

   StudentID    Name  Age    Topic_1_E1_C1 Topic_E1_C1
0          1     Tom   20  DigestiveSystem       Italy
1          2  Joseph   21           Botany     Germany
2          3   Krish   19    Cell Bilology      France
3          4    John   18  Cell-Physiology      Sweden
4          5    Linn   20   Nervous-System      Poland

Function to create a CSV files from a dataframe based on Chunk Size
especially useful to create file for upload in another system where their is restrictions 
in the nos of records or file Sizes etc.

In [62]:
from more_itertools import sliced
import csv

def createCSVsforImport(chunk_size, OutputLocation,dataframeInput):    
    index_slices = sliced(range(len(dataframeInput)), chunk_size)    
    i=0
    for index_slice in index_slices:
        chunk = dataframeInput.iloc[index_slice] # your dataframe chunk ready for use
        chunk.to_csv(OutputLocation+'CSVFile_{id}.csv'.format(id = i), sep='|', encoding='utf-8-sig',index=False, line_terminator='\n' , escapechar='\\', quoting=csv.QUOTE_ALL,chunksize=50)#,quoting=csv.QUOTE_NONE, escapechar='\\')
        i = i+1

In [63]:
createCSVsforImport(2, "D:\\GITCODE\\Outputs\\",testdf)

In [64]:
### TO show the image of the output generated by the function above.
# import image module
from IPython.display import Image
  
# get the image
Image(url="1_CSVOutputs.jpg")

Code / Function to rename similar columns and combine/concatenate many columns into 1 , seperated by comma

In [68]:
df_concat = testdf.copy()
df_concat.head()

   StudentID    Name  Age    Topic_1_E1_C1 Topic_E1_C1
0          1     Tom   20  DigestiveSystem       Italy
1          2  Joseph   21           Botany     Germany
2          3   Krish   19    Cell Bilology      France
3          4    John   18  Cell-Physiology      Sweden
4          5    Linn   20   Nervous-System      Poland

In [69]:
# remove suffix
df_concat.columns = df_concat.columns.str.rstrip("_E1_C1")
df_concat.head()

   StudentID    Name  Age            Topic    Topic
0          1     Tom   20  DigestiveSystem    Italy
1          2  Joseph   21           Botany  Germany
2          3   Krish   19    Cell Bilology   France
3          4    John   18  Cell-Physiology   Sweden
4          5    Linn   20   Nervous-System   Poland

In [70]:
#combine-duplicate-columns-into-one
# REF : https://stackoverflow.com/questions/37932391/pandas-dataframe-combine-duplicate-columns-into-one-separate-data-by-comma
def cobinecols(y):
        return ','.join(y[y.notnull()].astype(str))
dfCombine = df_concat.groupby(level=0, axis=1).apply(lambda y: y.apply(cobinecols, axis=1))
dfCombine.head()

  Age    Name StudentID                   Topic
0  20     Tom         1   DigestiveSystem,Italy
1  21  Joseph         2          Botany,Germany
2  19   Krish         3    Cell Bilology,France
3  18    John         4  Cell-Physiology,Sweden
4  20    Linn         5   Nervous-System,Poland

In [76]:
##Convert DF wide to Long
dfw2L = pd.wide_to_long(testdf, stubnames=['Topic'], i=['StudentID'], j='TOPIC', suffix='\\w+' , sep='_').reset_index()
dfw2L.head()

   StudentID    TOPIC    Name  Age            Topic
0          1  1_E1_C1     Tom   20  DigestiveSystem
1          2  1_E1_C1  Joseph   21           Botany
2          3  1_E1_C1   Krish   19    Cell Bilology
3          4  1_E1_C1    John   18  Cell-Physiology
4          5  1_E1_C1    Linn   20   Nervous-System

### Demonstate conversion of Long to wide with some custom logic

In [6]:
# Sample dataframe to be used for this transformation
import pandas as pd
# assign data of lists.
data =  {'patientnummer': ['001', '001', '001', '001','001', '002', '002','002','003','004','004','004'], 
'date': ['6/30/2015','6/30/2015','6/30/2015','6/30/2015','6/30/2016','3/22/2018','2/11/2019','2/11/2019','6/30/2015','9/8/2017','9/8/2017','2/19/2018'],
'Item':['Fracture','Fatigue','Weight loss','Pain in extremity','Fatigue','Fatigue','Pain in extremity','Fatigue','Weight loss','Fatigue','Weight loss','Fatigue'],'score':[1,0,1,1,1,0,1,1,1,0,1,1]}
# Create DataFrame.
patient_df = pd.DataFrame(data)

print(patient_df.shape)
# Print the output.
print(patient_df)

(12, 4)
   patientnummer       date               Item  score
0            001  6/30/2015           Fracture      1
1            001  6/30/2015            Fatigue      0
2            001  6/30/2015        Weight loss      1
3            001  6/30/2015  Pain in extremity      1
4            001  6/30/2016            Fatigue      1
5            002  3/22/2018            Fatigue      0
6            002  2/11/2019  Pain in extremity      1
7            002  2/11/2019            Fatigue      1
8            003  6/30/2015        Weight loss      1
9            004   9/8/2017            Fatigue      0
10           004   9/8/2017        Weight loss      1
11           004  2/19/2018            Fatigue      1

In [13]:
patient_df_filtered = patient_df[patient_df['Item'].isin(['Chest wall pain'
                                                    ,'Dermatitis radiation'
                                                    ,'Edema limbs'
                                                    ,'Esophagitis'
                                                    ,'Fatigue'
                                                    ,'Lymphedema breast/chest'
                                                    ,'Pain breast'
                                                    ,'Pain in extremity'
                                                    ,'Weight loss'])]

print(patient_df_filtered.shape)
patient_df_filtered.head()

(11, 4)

  patientnummer       date               Item  score
1           001  6/30/2015            Fatigue      0
2           001  6/30/2015        Weight loss      1
3           001  6/30/2015  Pain in extremity      1
4           001  6/30/2016            Fatigue      1
5           002  3/22/2018            Fatigue      0

Add a column for rank based on unique combination of patient Id +Date as differnt patients fill same questionaiire at different dates

In [14]:
new_df=patient_df_filtered.sort_values(by=['patientnummer', 'date','Item'])
new_df=new_df.assign(rank=new_df['date']!=new_df['date'].shift())
new_df=new_df.assign(rank=new_df.groupby(['patientnummer'])['rank'].cumsum()).sort_index()
print(new_df.shape)
new_df.head()

(11, 5)

  patientnummer       date               Item  score  rank
1           001  6/30/2015            Fatigue      0   1.0
2           001  6/30/2015        Weight loss      1   1.0
3           001  6/30/2015  Pain in extremity      1   1.0
4           001  6/30/2016            Fatigue      1   2.0
5           002  3/22/2018            Fatigue      0   2.0

Now pivot this table based on patientId and rank

In [15]:
result = new_df.pivot_table(index=['patientnummer','rank','date' ],columns=['Item'],
                     values=['score'], aggfunc='first')
result.head(10)

                               score
Item                         Fatigue Pain in extremity Weight loss
patientnummer rank date
001           1.0  6/30/2015     0.0               1.0         1.0
              2.0  6/30/2016     1.0               NaN         NaN
002           1.0  2/11/2019     1.0               1.0         NaN
              2.0  3/22/2018     0.0               NaN         NaN
003           1.0  6/30/2015     NaN               NaN         1.0
004           1.0  2/19/2018     1.0               NaN         NaN
              2.0  9/8/2017      0.0               NaN         1.0

Now further flatten this resultset to have 1 row per patient

In [16]:
pivot_flat = pd.DataFrame(result.to_records())
pivot_flat.head(10)

,patientnummer,rank,date,"('score', 'Fatigue')","('score', 'Pain in extremity')","('score', 'Weight loss')"
0,001,1.0,6/30/2015,0.0,1.0,1.0
1,001,2.0,6/30/2016,1.0,NaN,NaN
2,002,1.0,2/11/2019,1.0,1.0,NaN
3,002,2.0,3/22/2018,0.0,NaN,NaN
4,003,1.0,6/30/2015,NaN,NaN,1.0
5,004,1.0,2/19/2018,1.0,NaN,NaN
6,004,2.0,9/8/2017,0.0,NaN,1.0

In [17]:
pivot_flat_unstack = pivot_flat.set_index(['patientnummer', 'rank']).unstack()
pivot_flat_unstack.columns = ['M'+str(int(c[1])) +'_'+c[0] for c in pivot_flat_unstack.columns]
pivot_flat_unstack.head()

,M1_date,M2_date,"M1_('score', 'Fatigue')","M2_('score', 'Fatigue')","M1_('score', 'Pain in extremity')","M2_('score', 'Pain in extremity')","M1_('score', 'Weight loss')","M2_('score', 'Weight loss')"
patientnummer,,,,,,,,
001,6/30/2015,6/30/2016,0.0,1.0,1.0,NaN,1.0,NaN
002,2/11/2019,3/22/2018,1.0,0.0,1.0,NaN,NaN,NaN
003,6/30/2015,NaN,NaN,NaN,NaN,NaN,1.0,NaN
004,2/19/2018,9/8/2017,1.0,0.0,NaN,NaN,NaN,1.0